# 2. DataFrame
2-dimensional data (collection of series)

## Data Preparation
Created using dictionary data structure
Ex. Eight guys data

In [14]:
data = {
    'Name' : ['AA', 'BB', 'CC', 'DD', 'EE', 'FF', 'GG', 'HH'],
    'School': ['AAA HS', 'BBB HS', 'CCC HS', 'DDD HS', 'EEE HS', 'FFF HS', 'GGG HS', 'HHH HS'],
    'Tall': [197, 184, 168, 187, 188, 202, 188, 190],
    'Korean': [90, 40, 80, 40, 15, 80, 55, 100],
    'English': [85, 35, 75, 60, 20, 100, 65, 85],
    'Math': [100, 50, 70, 70, 10, 95, 45, 90],
    'Science': [95, 55 ,80, 75, 35, 85, 40, 95],
    'Society': [85, 25, 75, 80, 10, 80, 35, 95],
    'SW Hobby': ['Python', 'Java', 'Javascript', '', '', 'C', 'Python', 'C#']
}
data

{'Name': ['AA', 'BB', 'CC', 'DD', 'EE', 'FF', 'GG', 'HH'],
 'School': ['AAA HS',
  'BBB HS',
  'CCC HS',
  'DDD HS',
  'EEE HS',
  'FFF HS',
  'GGG HS',
  'HHH HS'],
 'Tall': [197, 184, 168, 187, 188, 202, 188, 190],
 'Korean': [90, 40, 80, 40, 15, 80, 55, 100],
 'English': [85, 35, 75, 60, 20, 100, 65, 85],
 'Math': [100, 50, 70, 70, 10, 95, 45, 90],
 'Science': [95, 55, 80, 75, 35, 85, 40, 95],
 'Society': [85, 25, 75, 80, 10, 80, 35, 95],
 'SW Hobby': ['Python', 'Java', 'Javascript', '', '', 'C', 'Python', 'C#']}

In [15]:
data['Name']

['AA', 'BB', 'CC', 'DD', 'EE', 'FF', 'GG', 'HH']

In [16]:
data['Tall']

[197, 184, 168, 187, 188, 202, 188, 190]

## Creation of DataFrame Object (Assigning Column)
Choose the column you want from the data, and the order can be changed

In [23]:
import pandas as pd
df = pd.DataFrame(data)
df

  Name  School  Tall  Korean  English  Math  Science  Society    SW Hobby
0   AA  AAA HS   197      90       85   100       95       85      Python
1   BB  BBB HS   184      40       35    50       55       25        Java
2   CC  CCC HS   168      80       75    70       80       75  Javascript
3   DD  DDD HS   187      40       60    70       75       80
4   EE  EEE HS   188      15       20    10       35       10
5   FF  FFF HS   202      80      100    95       85       80           C
6   GG  GGG HS   188      55       65    45       40       35      Python
7   HH  HHH HS   190     100       85    90       95       95          C#

In [24]:
df = pd.DataFrame(data, columns=['Name', 'School', 'Tall'])
df

  Name  School  Tall
0   AA  AAA HS   197
1   BB  BBB HS   184
2   CC  CCC HS   168
3   DD  DDD HS   187
4   EE  EEE HS   188
5   FF  FFF HS   202
6   GG  GGG HS   188
7   HH  HHH HS   190

In [25]:
df = pd.DataFrame(data, columns=['Name', 'Tall', 'School'])
df

  Name  Tall  School
0   AA   197  AAA HS
1   BB   184  BBB HS
2   CC   168  CCC HS
3   DD   187  DDD HS
4   EE   188  EEE HS
5   FF   202  FFF HS
6   GG   188  GGG HS
7   HH   190  HHH HS